[{"term": null, "major": "CASLP", "course_number": "111S", "short_title": "LP111S", "full_title": "First-Semester Portuguese", "description": "A multimedia approach for students who have never studied Portugeuse. A variety of communicative tasks develop speaking, listening, reading, and writing skills.", "has_details": true, "is_registerable": false, "hub_attributes": "[\"Individual in Community\"]", "units": "4", "sections": []}, {"term": null, "major": "CASLP", "course_number": "112", "short_title": "LP112", "full_title": "Second-Semester Portuguese", "description": "Undergraduate Prerequisites: (CASLP111) or consent of instructor. - Covers the important grammar points not studied in CAS LP 111. Further develops the four communicative skills while expanding students' background knowledge of the history and cultures of the Portuguese- speaking world. Lab required. Four hours weekly. Effective Fall 2020, this course fulfills a single unit in the following BU Hub area: The Individual in Community.", "has_details": true, "is_registerable": false, "hub_attributes": "[\"Individual in Community\"]", "units": "4", "sections": []}, {"term": null, "major": "CASLP", "course_number": "112S", "short_title": "LP112S", "full_title": "Second-Semester Portuguese", "description": "Undergraduate Prerequisites: (CASLP111) or consent of instructor. - Completes study of basic grammatical structures. Emphasis on speaking and aural comprehension. Readings on contemporary culture. Writing assignments. ", "has_details": true, "is_registerable": false, "hub_attributes": "[\"Individual in Community\"]", "units": "4", "sections": []}, {"term": null, "major": "CASLP", "course_number": "123", "short_title": "LP123", "full_title": "Intensive Elementary Portuguese", "description": "Intensive elementary Portuguese for those with previous study of Spanish and other interested students. Equivalent of one year of college Portuguese. Emphasizes the four communicative skills: speaking, listening, reading, and writing. Introduces grammar and the culture of the Lusophone world through media broadcast, literature readings, films, music, and videotapes.", "has_details": true, "is_registerable": false, "hub_attributes": "[]", "units": "8", "sections": []}, {"term": "2248", "major": "CASLP", "course_number": "211", "short_title": "LP211", "full_title": "Third-Semester Portuguese", "description": "Undergraduate Prerequisites: (CASLP112) or placement test results. - Promotes cross-cultural understanding of the Luso-African-Brazilian cultures through authentic literary texts, multimedia, film and music. Completes study of grammatical structures and syntactical patterns. Emphasizes reading, writing and conversational competency. Conducted in Portuguese. Effective Fall 2020, this course fulfills a single unit in the following BU Hub area: The Individual in Community.", "has_details": true, "is_registerable": true, "hub_attributes": "[\"Individual in Community\"]", "units": "4", "sections": [{"class_section": "A1", "class_type": "IND", "professor_name": "Celia Bianconi", "class_capacity": 18, "enrollment_total": 13, "enrollment_available": 5, "days": "MoWeFr", "start_time": "11:15 am", "end_time": "12:05 pm", "location": "685-725 Comm Ave CAS 530"}]}, {"term": null, "major": "CASLP", "course_number": "212", "short_title": "LP212", "full_title": "Fourth-Semester Portuguese", "description": "Undergraduate Prerequisites: (CASLP211) or consent of instructor. - Review of the grammar and syntax of Portuguese. Further develops reading, writing, and conversational competency while expanding students' knowledge of history and culture. Conducted in Portuguese. Fulfills the CAS language requirement. Effective Fall 2018, this course fulfills a single unit in the following BU Hub area: Global Citizenship and Intercultural Literacy. Effective Fall 2020, this course fulfills a single unit in the following BU Hub areas: The Individual in Community, Global Citizenship and Intercultural Literacy.", "has_details": true, "is_registerable": false, "hub_attributes": "[\"Global Citizensh/Intercult\", \"Individual in Community\"]", "units": "4", "sections": []}, {"term": null, "major": "CASLP", "course_number": "224", "short_title": "LP224", "full_title": "Intensive Intermediate Portuguese", "description": "Undergraduate Prerequisites: (CASLP123) or equivalent, or consent of instructor. - Intensive intermediate Portuguese. Equivalent of second year of college Portuguese. Intermediate speaking, listening, reading, and writing skills with study of the culture of the Lusophone world. Completion of CAS LP 224 satisfies CAS foreign language requirement.", "has_details": true, "is_registerable": false, "hub_attributes": "[]", "units": "8", "sections": []}, {"term": "2248", "major": "CASLP", "course_number": "231", "short_title": "LP231", "full_title": "Portuguese for Spanish Speakers 1", "description": "Undergraduate Prerequisites: native or near-native speakers of Spanish only. - Designed to develop speaking, listening, reading, and writing skills in Portuguese for Spanish speakers. Focuses on comparisons between Spanish and Portuguese language systems for students to communicate accurately and effectively within a diversity of cultural situations. Effective Fall 202, this course fulfills a single unit in the following BU Hub area: The Individual in Community.", "has_details": true, "is_registerable": true, "hub_attributes": "[\"Individual in Community\"]", "units": "4", "sections": [{"class_section": "A1", "class_type": "IND", "professor_name": "Bene' Cruz", "class_capacity": 10, "enrollment_total": 10, "enrollment_available": 0, "days": "TuTh", "start_time": "12:30 pm", "end_time": "1:45 pm", "location": "685-725 Comm Ave CAS 430"}]}, {"term": null, "major": "CASLP", "course_number": "232", "short_title": "LP232", "full_title": "Portuguese for Spanish Speakers 2", "description": "Designed to continue to developing speaking, listening, reading, and writing skills in Portuguese. Focuses on comparisons between Spanish and Portuguese language systems for students to communicate accurately and effectively within a diversity of cultural situations. Effective Spring 2022, this course fulfills a single unit in the following BU Hub area: The Individual in Community.", "has_details": true, "is_registerable": false, "hub_attributes": "[\"Individual in Community\"]", "units": "4", "sections": []}, {"term": null, "major": "CASLP", "course_number": "305", "short_title": "LP305", "full_title": "Topics in Portuguese Language and Culture", "description": "Undergraduate Prerequisites: (CASLP212) or advanced Portuguese proficiency. - Taught in Portuguese. Can be repeated for credit as topics change. Explores historical, social, and political, aspects of Brazilian language and culture. Designed to increase fluency and accuracy in written and spoken Portuguese, broadening vocabulary and mastery of syntax. Topic for Fall 2023: Examines major Brazilian historical, political, and social developments through videos, films, literature, and media. Promotes intercultural competence and advances Portuguese proficiency skills in reading, writing, and speaking. Analyzes some important questions relating to contemporary Brazilian Identity. Effective Fall 2019, this course fulfills a single unit in the following BU Hub area: Global Citizenship and Intercultural Literacy.", "has_details": true, "is_registerable": false, "hub_attributes": "[\"Global Citizensh/Intercult\"]", "units": "4", "sections": []}, {"term": null, "major": "CASLP", "course_number": "307", "short_title": "LP307", "full_title": "Portuguese for Business and Professional Life", "description": "Undergraduate Prerequisites: (CASLP212) and consent of instructor. - This is a discussion-based course taught in Portuguese. It helps you develop effective reading, speaking and writing strategies needed to interpret authentic written and audio-visual sources, exploring different aspects of professional life in the Brazilian and the Portuguese-speaking world. Effective Spring 2020, this course fulfills a single unit in each of the following BU Hub areas: Digital/Multimedia Expression, Social Inquiry II, Teamwork/Collaboration.", "has_details": true, "is_registerable": false, "hub_attributes": "[\"Digital/Multimedia Express\", \"Social Inquiry II\", \"Teamwork/Collaboration\"]", "units": "4", "sections": []}, {"term": "2248", "major": "CASLP", "course_number": "308", "short_title": "LP308", "full_title": "Brazilian History and Contemporary Identities", "description": "Undergraduate Prerequisites: CAS LP 212 or placement results or consent of instructor. - Students develop intercultural competence by analyzing the influence of history on on contemporary Brazilian identity. Written and oral work explores colonial legacy in relation to culture, race, and ethnicity. Readings and screenings present diverse voices within Brazil and interactions with other Portuguese-speaking countries. Effective Fall 2024, this course fulfills a single unit in each of the following BU Hub areas: Historical Consciousness, Oral and/or Signed Communication.", "has_details": true, "is_registerable": true, "hub_attributes": "[\"Historical Consciousness\", \"Oral/Signed Communication\"]", "units": "4", "sections": [{"class_section": "A1", "class_type": "IND", "professor_name": "Celia Bianconi", "class_capacity": 15, "enrollment_total": 4, "enrollment_available": 11, "days": "MoWeFr", "start_time": "2:30 pm", "end_time": "3:20 pm", "location": "5 Cummington Mall BRB 122"}]}, {"term": null, "major": "CASLP", "course_number": "312", "short_title": "LP312", "full_title": "Inventing Brazil (in English Translation)", "description": "Exploration of several cultural realms, tropes, and intellectual disciplines--- literature, history, art, film, sociology, anthropology--- that situate Brazil within Western modernity.", "has_details": true, "is_registerable": false, "hub_attributes": "[]", "units": "4", "sections": []}, {"term": null, "major": "CASLP", "course_number": "350", "short_title": "LP350", "full_title": "Brazilian Literature Before 1900", "description": "Undergraduate Prerequisites: (CASLP212) or consent of instructor. - Brazilian literature from the colonial period to 1900. Topics include Jesuits and indigenous peoples; the Baroque and satirical poetry; the struggle for independence; the abolition of slavery; the process of modernization; the rise of the metropolis.", "has_details": true, "is_registerable": false, "hub_attributes": "[]", "units": "4", "sections": []}, {"term": null, "major": "CASLP", "course_number": "352", "short_title": "LP352", "full_title": "Tropical Metropolis and Brazilian Modernity", "description": "Undergraduate Prerequisites: (CASLP212) or consent of instructor. - Focus on aesthetic and thematic changes in Brazilian art and literature during the country's waves of modernization, with attention to the repercussion of those themes in film production, music, and performance. Effective Fall 2019, this course fulfills a single unit in the following BU Hub areas: Aesthetic Exploration, Global Citizenship and Intercultural Literacy.", "has_details": true, "is_registerable": false, "hub_attributes": "[\"Aesthetic Exploration\", \"Global Citizensh/Intercult\"]", "units": "4", "sections": []}, {"term": null, "major": "CASLP", "course_number": "360", "short_title": "LP360", "full_title": "Introduction to Brazilian Cinema (in English translation)", "description": "An overview of Brazilian cinema in the 60s, 70s and 80s, its discourse on revolution and marginality, as well as its connection to artistic, musical, and literary movements. Focus on the work of avant-garde filmmakers and younger generations. Also includes attention to Cuban cinema. Taught in English. Also offered as CAS CI 321. Effective Fall 2019, this course fulfills a single unit in the following BU Hub areas: Aesthetic Exploration, Global Citizenship and Intercultural Literacy.", "has_details": true, "is_registerable": false, "hub_attributes": "[\"Aesthetic Exploration\", \"Global Citizensh/Intercult\"]", "units": "4", "sections": []}, {"term": "2248", "major": "CASLP", "course_number": "362", "short_title": "LP362", "full_title": "Inventing Brazil (in English Translation)", "description": "This course focuses on the main figures who undertook the task of forging the national image of Brazil in the 20th century. It encompasses several cultural realms and intellectual disciplines -- literature, history, art, film, sociology, and anthropology. Effective Fall 2019, this course fulfills a single unit in the following BU Hub areas: Aesthetic Exploration, Global Citizenship and Intercultural Literacy.", "has_details": true, "is_registerable": true, "hub_attributes": "[\"Aesthetic Exploration\", \"Global Citizensh/Intercult\"]", "units": "4", "sections": [{"class_section": "A1", "class_type": "IND", "professor_name": "To Be Announced", "class_capacity": 15, "enrollment_total": 9, "enrollment_available": 6, "days": "TuTh", "start_time": "3:30 pm", "end_time": "4:45 pm", "location": "685-725 Comm Ave CAS 430"}]}, {"term": "2248", "major": "CASLP", "course_number": "491", "short_title": "LP491", "full_title": "DS:PORTUGUESE", "description": "DS:PORTUGUESE", "has_details": true, "is_registerable": true, "hub_attributes": "[]", "units": "0.5", "sections": [{"class_section": "X1", "class_type": "DRS", "professor_name": "To Be Announced", "class_capacity": 5, "enrollment_total": 0, "enrollment_available": 5, "days": "TBA", "start_time": null, "end_time": null, "location": "TBA"}]}, {"term": null, "major": "CASLP", "course_number": "492", "short_title": "LP492", "full_title": "DS:PORTUGUESE", "description": "DS:PORTUGUESE", "has_details": true, "is_registerable": false, "hub_attributes": "[]", "units": "0.5", "sections": []}, {"term": null, "major": "CASLP", "course_number": "580", "short_title": "LP580", "full_title": "Music and Politics in Brazil", "description": "Undergraduate Prerequisites: (CASLP212) or Portuguese proficiency, or consent instructor. - Studies the relationship between Brazilian music and politics, from the modernist revolution with Villa-Lobos to Carioca funk. Other music genres are also studied, such as bossa nova, tropicalia, samba, rock, heavy metal, (hardcore) punk rock, and hip-hop. Effective Spring 2022, this course fulfills a single unit in each of the following BU Hub areas: Global Citizenship and Intercultural Literacy, Aesthetic Exploration.", "has_details": true, "is_registerable": false, "hub_attributes": "[\"Aesthetic Exploration\", \"Global Citizensh/Intercult\"]", "units": "4", "sections": []}]