[{"term": null, "major": "CASMS", "course_number": "491", "short_title": "MS491", "full_title": "Directed Study in Medical Sciences", "description": "A directed study in a topic in medical sciences.", "has_details": true, "is_registerable": false, "hub_attributes": "[]", "units": "0.5", "sections": []}, {"term": null, "major": "CASMS", "course_number": "492", "short_title": "MS492", "full_title": "Directed Study in Medical Sciences", "description": "A directed study in a topic in medical sciences.", "has_details": true, "is_registerable": false, "hub_attributes": "[]", "units": "0.5", "sections": []}, {"term": null, "major": "CASMS", "course_number": "501", "short_title": "MS501", "full_title": "Seven-Year Liberal Arts/Medical Education Program Hub Sequence Semester 1", "description": "Undergraduate Prerequisites: status as fourth-year (first year Medical Student) in the Seven-Year L iberal Arts/Medical Education Program - Along with CAS MS 502, this course is required for students enrolled in the fourth year of the Seven-Year Liberal Arts/Medical Education Program (first year in medical school, final year of undergraduate education). It represents the Hub units acquired after successfully completing the first-year medical school curriculum, and does not add any additional credits or contact hours to students' schedules. Effective Fall 2021, this course is approved as part of a Hub sequence and does not, itself, carry any units. After successfully completing CAS MS 502, this Hub course sequence fulfills one unit each of Social Inquiry 1, The Individual in Community, Global Citizenship and Intercultural Literacy, Ethical Reasoning, Oral and/or Signed Communication, and Teamwork/Collaboration.", "has_details": true, "is_registerable": false, "hub_attributes": "[]", "units": "0", "sections": []}, {"term": null, "major": "CASMS", "course_number": "502", "short_title": "MS502", "full_title": "Seven-Year Liberal Arts/Medical Education Program Hub Sequence Semester 2", "description": "Undergraduate Prerequisites: status as fourth-year (first year Medical Student) in the Seven-Year L iberal Arts/Medical Education Program - Along with CAS MS 501, this course is required for students enrolled in the fourth year of the Seven-Year Liberal Arts/Medical Education Program (first year in medical school, final year of undergraduate education). It represents the Hub units acquired after successfully completing the first-year medical school curriculum, and does not add any additional credits or contact hours to students' schedules. Effective Fall 2021, this course is approved as part of a Hub sequence. Students who successfully completing this Hub course sequence will fulfill one unit each of Social Inquiry 1, The Individual in Community, Global Citizenship and Intercultural Literacy, Ethical Reasoning, Oral and/or Signed Communication, and Teamwork/Collaboration.", "has_details": true, "is_registerable": false, "hub_attributes": "[\"Ethical Reasoning\", \"Global Citizensh/Intercult\", \"Individual in Community\", \"Oral Signed Communication\", \"Social Inquiry I\", \"Teamwork/Collaboration\"]", "units": "0", "sections": []}]